{
  "architectures": [
    "MistralMindSkipForCausalLM"
  ],
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_mistral_mindskip.MistralMoDConfig",
    "AutoModelForCausalLM": "modeling_mistral_mindskip.MistralForCausalLM"
  },
  "bos_token_id": 1,
  "eos_token_id": 2,
  "gradient_scale": 0.0,
  "granularity": "attn_sequence",
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 32768,
  "model_type": "mistral_mindskip",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "rms_norm_eps": 1e-05,
  "rope_theta": 1000000.0,
  "sliding_window": null,
  "threshold": 0.5,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.40.1",
  "use_cache": false,
  "vocab_size": 32768
}
