{
  "architectures": [
    "Qwen2MindSkipForCausalLM"
  ],
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_qwen2_mindskip.Qwen2MindSkipConfig",
    "AutoModelForCausalLM": "modeling_qwen2_mindskip.Qwen2MindSkipForCausalLM"
  },
  "bos_token_id": 151643,
  "eos_token_id": 151643,
  "gradient_scale": 0.0,
  "granularity": "attn_sequence",
  "hidden_act": "silu",
  "hidden_size": 3584,
  "initializer_range": 0.02,
  "intermediate_size": 18944,
  "max_position_embeddings": 131072,
  "max_window_layers": 28,
  "model_type": "qwen2_mindskip",
  "num_attention_heads": 28,
  "num_hidden_layers": 28,
  "num_key_value_heads": 4,
  "rms_norm_eps": 1e-06,
  "rope_theta": 1000000.0,
  "sliding_window": 131072,
  "threshold": 0.5,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.40.1",
  "use_cache": false,
  "use_mrope": false,
  "use_sliding_window": false,
  "vocab_size": 152064
}
