{
  "architectures": [
    "LlamaMindSkipForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_llama_mindskip.LlamaMoDConfig",
    "AutoModelForCausalLM": "modeling_llama_mindskip.LlamaMoDForCausalLM"
  },
  "bos_token_id": 128000,
  "eos_token_id": 128001,
  "gradient_scale": 0.0,
  "granularity": "attn_sequence",
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 8192,
  "model_type": "llama_mindskip",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 500000.0,
  "threshold": 0.5,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "train_threshold": false,
  "transformers_version": "4.40.1",
  "use_cache": false,
  "vocab_size": 128256
}
